/**
 * The job data
 * 
 * @const {object}
 */
const Jobs = {
    adele: {
        name: "阿戴爾",
        coreskills: {
            切割: [
                "共鳴-命令-切割",
                "共鳴-創造-切割",
                "共鳴-開花-切割",
                "共鳴-碎片-切割",
                "命令-共鳴-切割",
                "命令-創造-切割",
                "命令-開花-切割",
                "命令-碎片-切割",
                "命令-領域-切割",
                "領域-開花-切割"
            ],
            穿刺: [
                "命令-創造-穿刺-魔劍共鳴-魔力爆裂",
                "命令-開花-穿刺-魔劍共鳴-魔力爆裂",
                "命令-碎片-穿刺-魔劍共鳴-魔力爆裂",
                "命令-截斷-穿刺-魔劍共鳴-魔力爆裂",
                "碎片-開花-穿刺-魔劍共鳴-魔力爆裂",
                "截斷-命令-穿刺-魔劍共鳴-魔力爆裂",
                "截斷-創造-穿刺-魔劍共鳴-魔力爆裂",
                "截斷-開花-穿刺-魔劍共鳴-魔力爆裂",
                "截斷-碎片-穿刺-魔劍共鳴-魔力爆裂",
                "截斷-領域-穿刺-魔劍共鳴-魔力爆裂"
            ],
            追蹤: [
                "共鳴-創造-追蹤-死亡標記",
                "共鳴-開花-追蹤-死亡標記",
                "共鳴-碎片-追蹤-死亡標記",
                "共鳴-截斷-追蹤-死亡標記",
                "共鳴-領域-追蹤-死亡標記",
                "截斷-共鳴-追蹤-死亡標記",
                "截斷-創造-追蹤-死亡標記",
                "截斷-開花-追蹤-死亡標記",
                "截斷-碎片-追蹤-死亡標記",
                "截斷-領域-追蹤-死亡標記"
            ],
            創造: [
                "命令-共鳴-創造-回歸",
                "命令-開花-創造-回歸",
                "命令-碎片-創造-回歸",
                "命令-截斷-創造-回歸",
                "碎片-共鳴-創造-回歸",
                "截斷-共鳴-創造-回歸",
                "截斷-命令-創造-回歸",
                "截斷-開花-創造-回歸",
                "截斷-碎片-創造-回歸",
                "截斷-領域-創造-回歸"
            ],
            碎片: [
                "共鳴-領域-碎片-奇蹟",
                "命令-共鳴-碎片-奇蹟",
                "命令-創造-碎片-奇蹟",
                "命令-開花-碎片-奇蹟",
                "命令-截斷-碎片-奇蹟",
                "截斷-共鳴-碎片-奇蹟",
                "截斷-命令-碎片-奇蹟",
                "截斷-創造-碎片-奇蹟",
                "截斷-開花-碎片-奇蹟",
                "截斷-領域-碎片-奇蹟"
            ],
            綻放: [
                "命令-共鳴-綻放-狂風",
                "命令-創造-綻放-狂風",
                "命令-碎片-綻放-狂風",
                "命令-截斷-綻放-狂風",
                "命令-領域-綻放-狂風",
                "截斷-共鳴-綻放-狂風",
                "截斷-命令-綻放-狂風",
                "截斷-創造-綻放-狂風",
                "截斷-碎片-綻放-狂風",
                "截斷-領域-綻放-狂風"
            ],
            劍域: [
                "命令-共鳴-劍域-踐踏",
                "命令-創造-劍域-踐踏",
                "命令-截斷-劍域-踐踏",
                "創造-共鳴-劍域-踐踏",
                "創造-命令-劍域-踐踏",
                "截斷-共鳴-劍域-踐踏",
                "截斷-命令-劍域-踐踏",
                "截斷-創造-劍域-踐踏",
                "截斷-開花-劍域-踐踏",
                "截斷-碎片-劍域-踐踏"
            ]
        },
        skills: [
            "切割",
            "穿刺",
            "追蹤",
            "創造",
            "碎片",
            "綻放",
            "劍域"
        ]
    }
};
