/**
 * The job data
 * 
 * @const {object}
 */
const Jobs = {
    adele: {
        name: "阿戴爾",
        skillImagePath: "images/jobs/adele/skills/{skill}.png",
        skills: [
            "切割",
            "穿刺",
            "追蹤",
            "創造",
            "碎片",
            "綻放",
            "劍域"
        ],
        coreskillImagePath: "images/jobs/adele/cores/{skill}/{core}.png",
        cores: {
            切割: [
                "共鳴-命令-切割",
                "共鳴-創造-切割",
                "共鳴-開花-切割",
                "共鳴-碎片-切割",
                "命令-共鳴-切割",
                "命令-創造-切割",
                "命令-開花-切割",
                "命令-碎片-切割",
                "命令-領域-切割",
                "領域-開花-切割"
            ],
            穿刺: [
                "命令-創造-穿刺-魔劍共鳴-魔力爆裂",
                "命令-開花-穿刺-魔劍共鳴-魔力爆裂",
                "命令-碎片-穿刺-魔劍共鳴-魔力爆裂",
                "命令-截斷-穿刺-魔劍共鳴-魔力爆裂",
                "碎片-開花-穿刺-魔劍共鳴-魔力爆裂",
                "截斷-命令-穿刺-魔劍共鳴-魔力爆裂",
                "截斷-創造-穿刺-魔劍共鳴-魔力爆裂",
                "截斷-開花-穿刺-魔劍共鳴-魔力爆裂",
                "截斷-碎片-穿刺-魔劍共鳴-魔力爆裂",
                "截斷-領域-穿刺-魔劍共鳴-魔力爆裂"
            ],
            追蹤: [
                "共鳴-創造-追蹤-死亡標記",
                "共鳴-開花-追蹤-死亡標記",
                "共鳴-碎片-追蹤-死亡標記",
                "共鳴-截斷-追蹤-死亡標記",
                "共鳴-領域-追蹤-死亡標記",
                "截斷-共鳴-追蹤-死亡標記",
                "截斷-創造-追蹤-死亡標記",
                "截斷-開花-追蹤-死亡標記",
                "截斷-碎片-追蹤-死亡標記",
                "截斷-領域-追蹤-死亡標記"
            ],
            創造: [
                "命令-共鳴-創造-回歸",
                "命令-開花-創造-回歸",
                "命令-碎片-創造-回歸",
                "命令-截斷-創造-回歸",
                "碎片-共鳴-創造-回歸",
                "截斷-共鳴-創造-回歸",
                "截斷-命令-創造-回歸",
                "截斷-開花-創造-回歸",
                "截斷-碎片-創造-回歸",
                "截斷-領域-創造-回歸"
            ],
            碎片: [
                "共鳴-領域-碎片-奇蹟",
                "命令-共鳴-碎片-奇蹟",
                "命令-創造-碎片-奇蹟",
                "命令-開花-碎片-奇蹟",
                "命令-截斷-碎片-奇蹟",
                "截斷-共鳴-碎片-奇蹟",
                "截斷-命令-碎片-奇蹟",
                "截斷-創造-碎片-奇蹟",
                "截斷-開花-碎片-奇蹟",
                "截斷-領域-碎片-奇蹟"
            ],
            綻放: [
                "命令-共鳴-綻放-狂風",
                "命令-創造-綻放-狂風",
                "命令-碎片-綻放-狂風",
                "命令-截斷-綻放-狂風",
                "命令-領域-綻放-狂風",
                "截斷-共鳴-綻放-狂風",
                "截斷-命令-綻放-狂風",
                "截斷-創造-綻放-狂風",
                "截斷-碎片-綻放-狂風",
                "截斷-領域-綻放-狂風"
            ],
            劍域: [
                "命令-共鳴-劍域-踐踏",
                "命令-創造-劍域-踐踏",
                "命令-截斷-劍域-踐踏",
                "創造-共鳴-劍域-踐踏",
                "創造-命令-劍域-踐踏",
                "截斷-共鳴-劍域-踐踏",
                "截斷-命令-劍域-踐踏",
                "截斷-創造-劍域-踐踏",
                "截斷-開花-劍域-踐踏",
                "截斷-碎片-劍域-踐踏"
            ]
        },
        coreskills: {
            切割: [
                [0, 1, 2],
                [0, 1, 3],
                [0, 1, 5],
                [0, 1, 4],
                [0, 2, 1],
                [0, 2, 3],
                [0, 2, 5],
                [0, 2, 4],
                [0, 2, 6],
                [0, 6, 5]
            ],
            穿刺: [
                [1, 2, 3],
                [1, 2, 5],
                [1, 2, 4],
                [1, 2, 0],
                [1, 4, 5],
                [1, 0, 2],
                [1, 0, 3],
                [1, 0, 5],
                [1, 0, 4],
                [1, 0, 6]
            ],
            追蹤: [
                [2, 1, 3],
                [2, 1, 5],
                [2, 1, 4],
                [2, 1, 0],
                [2, 1, 6],
                [2, 0, 1],
                [2, 0, 3],
                [2, 0, 5],
                [2, 0, 4],
                [2, 0, 6]
            ],
            創造: [
                [3, 2, 1],
                [3, 2, 5],
                [3, 2, 4],
                [3, 2, 0],
                [3, 4, 1],
                [3, 0, 1],
                [3, 0, 2],
                [3, 0, 5],
                [3, 0, 4],
                [3, 0, 6]
            ],
            碎片: [
                [4, 1, 6],
                [4, 2, 1],
                [4, 2, 3],
                [4, 2, 5],
                [4, 2, 0],
                [4, 0, 1],
                [4, 0, 2],
                [4, 0, 3],
                [4, 0, 5],
                [4, 0, 6]
            ],
            綻放: [
                [5, 2, 1],
                [5, 2, 3],
                [5, 2, 4],
                [5, 2, 0],
                [5, 2, 6],
                [5, 0, 1],
                [5, 0, 2],
                [5, 0, 3],
                [5, 0, 4],
                [5, 0, 6]
            ],
            劍域: [
                [6, 2, 1],
                [6, 2, 3],
                [6, 2, 0],
                [6, 3, 1],
                [6, 3, 2],
                [6, 0, 1],
                [6, 0, 2],
                [6, 0, 3],
                [6, 0, 5],
                [6, 0, 4]
            ]
        }
    }
};
